In [22]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [23]:
titanic=pd.read_csv("submission.csv")
titan=titanic
titan.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,Unspecified,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,Unspecified,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,Unspecified,S

In [24]:
titan.drop(['PassengerId', 'Name', 'SibSp','Parch','Ticket','Cabin','Embarked'], axis = 'columns', inplace = True)
titan.head()

   Survived  Pclass     Sex  Age     Fare
0         0       3    male   22   7.2500
1         1       1  female   38  71.2833
2         1       3  female   26   7.9250
3         1       1  female   35  53.1000
4         0       3    male   35   8.0500

In [25]:
df= titan.drop('Survived',axis='columns')
target = titan.Survived

In [26]:
df.Sex = df.Sex.map({'male': 1, 'female': 2})
df

     Pclass  Sex  Age     Fare
0         3    1   22   7.2500
1         1    2   38  71.2833
2         3    2   26   7.9250
3         1    2   35  53.1000
4         3    1   35   8.0500
..      ...  ...  ...      ...
707       3    2   39  29.1250
708       2    1   27  13.0000
709       1    2   19  30.0000
710       1    1   26  30.0000
711       3    1   32   7.7500

[712 rows x 4 columns]

In [27]:
df.Age[:10]

0    22
1    38
2    26
3    35
4    35
5    54
6     2
7    27
8    14
9     4
Name: Age, dtype: int64

In [28]:
from sklearn.model_selection import train_test_split

In [75]:
X_train, X_test, y_train, y_test = train_test_split(df,target,test_size=0.4)

In [76]:
from sklearn.svm import SVC

In [77]:
model = SVC()
model.fit(X_train,y_train)

SVC()

In [78]:
pred=model.predict(X_test)
pred

array([0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0,
       0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1,
       1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0,
       0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0,
       0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0,
       1, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0,
       0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0,
       0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0,
       0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0],
      dtype=int64)

In [79]:
model.score(X_test,y_test)

0.6877192982456141